{"podcast_details": {"podcast_title": "The Tech Talks Daily Podcast", "episode_title": "2484: How Your Data Infrastructure Budget Will Determine Your Fate", "episode_image": "https://ssl-static.libsyn.com/p/assets/9/d/2/0/9d20c43ed1f13f50e5bbc093207a2619/techtalkdailyfinal.png", "episode_transcript": " Welcome back to another episode of the Tech Talks Daily Podcast. I'm your host, Neil C. Hughes, and today we're going to be diving deep into the realm of data infrastructure. An area that may not always get the limelight it deserves, but it does hold significant potential for businesses right across the globe. And as the data infrastructure construction market is anticipated to skyrocket with a CAGR of plus 7% by 2030 alone, I think it's safe to assume that it is crucial for business leaders to understand its impact and potential business value. So to shed light on this, I have with me today Diana Boldt, the president of Blue Orange Digital. And she's also a seasoned expert with over two decades of experience in guiding businesses through digital transformation and sustainable product building. So buckle up and hold on tight as I beam your ears all the way to New York City where Diana is waiting to share her story. So a massive warm welcome to the show. Can you tell everyone listening a little about who you are and what you do? Hi, Neil. It's great to chat with you today and thanks for having me on. I'm Diana Boldt. I'm president and chief operating officer of Blue Orange. We are a data consulting firm specializing in data science, machine learning, and AI. We help businesses gain insights, make better decisions, and improve their products and services with data. I joined Blue Orange in January this year. And prior to Blue Orange, I was Thoughtbot's CEO and managing director. Thoughtbot is a software development company that specializes in the Ruby programming language. Before that, I was in executive roles at Liberty Mutual, RPG and MDC partner agencies, ID and Assembly that I spent 10 years at Univision. And before that, I put myself through undergrad and grad schools working in tech full time as a webmaster. Back then, it was early days of digital transformation. So I was helping lawyers transition from the analog world to the digital world. So that's who I am. Wow. Incredibly. You've been incredibly busy and a very cool backstory there. So much to unpack. I mean, Blue Orange Digital is a great name. I'd love to find out more about, I almost feel there's got to be a story behind that name. But as the president of Blue Orange Digital, can you explain what you guys do and how the company is assisting businesses with their digital transformation? Because you, from your past and listening to your story there, you played a big part in several different stages of that and right from the very beginning. But here in 2023, how are you continuing on that and helping businesses with their digital transformation? Yeah. Blue Orange specializes on the data side of digital transformation. So really, that's our expertise. We help companies at every level of digital maturity. So we help them discover insights and make better decisions with data. And we help them make the infrastructure to make that happen. When you think about the data maturity spectrum, on the one side, you have like data cleaning, ingestion, transformation and delivery. And we help with all that. We help with data transformation as well. So building and deploying models and delivering visualizations. And then on the other end of the spectrum, you can think of it as more like data forecasting, predictions, advanced analytics, and bespoke machine learning and AI needs. We help with that as well. And everything in the middle of that spectrum, we cover. So we help with helping clients combine structured, semi-structured and unstructured data and different mapping schemas. We help with data security and data governance. We help with proofs of concepts and MVPs. And we help build upscaling and training the team. And then for the business leaders who maybe are not so technical, we'll help them with visioning and strategy. We help them with technology selection and implementation. And then we help them with change management and training and mentoring their teams as well. It was funny because our founder, you mentioned this backstory with Blue Orange, and I've been having this conversation with our founder for a while now. And last week, we realized that he's really much into mountaineering. And I love nature. We got really excited because we felt like mountaineering and what we do, there's so many analogies here. And the sky is blue and the sun is orange. And nature is full of the two colors. And anyway, we went really into like nerd it out on data and mountaineering. And to me, a lot of what we do is like helping clients reach the summit. And you think of the summit as like hidden insights and gems. You look at when you climb a mountain, you see the world in a whole different way. And that's kind of what we do. We help clients see the world in a different way through data. What an incredibly cool way of describing it. Absolutely love that. And of course, every single person listening to this podcast today, we've all been on somewhat of a journey over the last three, four years. Obviously, we had the global pandemic, the shift from working in an office to remote working to hybrid working. And then we've got the economic uncertainty, high interest rates, high inflation. I think every tech project is now coming under close scrutiny for the value that it offers and the ROI on a tech project, for example. So I'm curious, if we look back over the last few years, and indeed this year, what unique challenges and opportunities have you faced when assisting businesses with digital transformation? Well, yeah, that's a tough one. Like I can go deep into a lot of these things. And maybe there's not enough time and some of this information is confidential or what have you. But I can speak in generalities. For example, I was thinking back to when our founder and I were brainstorming about the significance of blue and orange. I realized that when I was very, very young, I was helping lawyers move from working with paper to working with computers. And I can't believe I'm still doing this, but I'm doing it in a totally different way. Now I'm doing it with advances in data and AI and generative AI. But it's still the same. It's still guiding people towards a transformation. And I've come to realize that for me, challenges and opportunities have turned out to be the same thing. I think about the yin and the yang and opposing forces harmoniously balancing each other. I think about Isaac Newton's third law of motion for every action, there is an equal and opposite reaction. And to me, challenges and opportunities come in pairs. And although we're constantly facing challenges, to me, we're also constantly facing opportunities. And right now it's keeping up with the pace, like you said, keeping up with the pace of change. How do we do it? And I think what I've come to do is just make learning part of my life. Every day I learn something, even if it's just five minutes, I promise myself to learn something. I attend industry events. I've been subscribed in newsletters. I tune into Coursera or I'll take a course. I love having conversations with vendors because you actually learn a lot about what they're doing. I read journals and tech talks like yourself, Neil. So it's constantly learning. And I think another thing I've done is continuous experimentation. So it's trying something, adjusting, pivoting when it doesn't work and then trying it again. And I've come to realize that I'm always in perpetual beta. I will never be ready for prime time because I'm constantly learning and constantly adjusting and trying to improve myself. Anyway, I don't know if I answered your question, but I took you on a opportunity journey there. The how is incredibly cool, Lance. Absolutely. What are you doing there? Every day is a school day. We're all working progress. And I think it's never been more important to keep up to speed with the latest trends and everything that's happening and the new technologies because I think we're all on this journey of continuous learning now. And if we go back a few years, I think it was Mark Cuban that famously said data is the new oil. Yet despite that we're still left with many, many data silos and investing in infrastructure, particularly data infrastructure is often seen as a less exciting aspect of a business operation. I'm hopeful that will change with the importance of AI and machine learning and the clean data that is required to bring those things to life. But I'm curious from your point of view, why should organizations reconsider that traditional mindset and recognize the immense potential that it holds? Yeah, not only immense potential, but I mean, you say less exciting, but I actually disagree with you. I think data is very exciting. So you think about the data's broad relevance and it's so interesting. I mean, I mentioned earlier, getting to the top of the summit and seeing things from a whole different way. And we're able to personalize experiences. We're able to predict, well, not really predict the future, but we can predict trends. We can look at, we can make discoveries. We can empower ourselves to take control of our own health and wellbeing. We can learn to be better storytellers. We can reveal patterns. I mean, I can go on and on. I can nerd out with you for a very long time on this. But I mean, it doesn't matter. Healthcare insurance, bioscience data is core to discovery innovation. And on a large scale, data can transform societies. And then when you think about the pioneering, the mountaineering analogy that I made earlier, and like all along the way, you need to know where you're going. How are we going to get to the top of the mountain? How are we going to make that summit? You need to have the proper training. You need to have the proper equipment. And the same here, you need to have statistics. You need to have data visualization tools, programming knowledge, machine learning to help you achieve your goals. Once you're navigating up the mountain, it could be treacherous. You could commit to obstacles. You could get sick. Weather can get bad. Same with data. We have to figure out data quality. We run across complex data sets and identifying patterns. And then in mountaineering, you have to work together for safety and success. And same with teams. We all have to communicate across disciplines, across different business units. Mountaineering is iterative. You have to change. We might have to take another route. With data analytics, you have to iterate as well. You have to maybe consider other data sets. And then in mountaineering, failures turn into valuable lessons in data. When you fail an analytical attempt, you have to try a different strategy. Mountaineers take care of the environment. They protect local communities. We have to think about data privacy and security and governance and potential biases for analysis. Mountaineering requires perseverance and learning, as we talked about. And I think data scientists are always continuously learning, continuously looking at new data sets. So it's a very important thing. So I'm trying to take you on a journey here to show you that it's not like the old stereotypical way that people might have thought of data. It's actually quite fun and quite interesting and exciting. I hope I took you on a little journey with me there, Neil. You really did. And I suspect you took people listening all around the world on that same journey. And I was playing devil's advocate, Pali, there because I know in some circles of business, people don't see or struggle to see the value, struggle to see the ROI. But as I said in my question to you there, I am hopeful that this attitude is changing now, especially with the importance of data in AI and machine learning. So if we have set off those light bulb moments with people listening all around the world, how would you advise organizations to approach budgeting for data infrastructure? And what are some of the key considerations and maybe even potential pitfalls that they should keep in mind when launching a project like this? Yeah. Well, I recommend thinking in terms of both short and long-term budgets, of course. We should always begin with our goals. Always start with the overall business and departmental goals. You got to start there. Got to think about like, what do you want? Do you want business intelligence? Do you want real-time analytics, automation, machine learning? Think about your data needs now and how they tend to evolve because as we know, data just keeps growing and growing and the data needs are going to continue to evolve and you need to be scalable. You need to take a look at where your data sits, how much of the data that you have, how fast does it change. And folks need to keep in mind that images, audio and video are all data. That all counts as data. So taking it like a where you are, where you want to go, develop a gap analysis to help you get to that transition and budget also for the implementation of it, like upskilling, training, support. And then some considerations to keep in mind is like cloud-based infrastructure is more cost-effective than on-premises, especially for the smaller and medium-sized companies. And they also offer like flexibility and scalability and may cover maintenance as well. And then data security and compliance considerations are important. So particularly keep an eye on things that are changing. If you're in a highly regulated industry, how will new regulations impact your data needs and protection of that data? And you want to, of course, put a budget for hiring and training for the new data scale sets. And tech, I think another pivotal thing to keep in mind is especially for small and medium sized firms, they tend to incur a lot of technical debt. So they might go for the quick and easy solution today or withhold an upgrade or a maintenance project, but then sooner or later that'll catch up with them. And then outdated infrastructures can become a liability in particular with data. So you want to make sure you budget for that too. And then be careful with vendor lock-in. You always want to be careful with that. And some tools may not integrate well with other tools. So you want to make sure you budget for that too. Fantastic advice. And before you came on the podcast today, I was reading about the global data infrastructure construction market is actually projected to grow significantly by 2030. And say we're only a few months away from 2024, that is going to be here much sooner than many people realize. And I'm curious, there's someone right in the heart of this space, what factors do you think are driving this growth? And how can organizations better position themselves to take that proactive rather than reactive approach to take advantage of it? There's so many factors that are impacting this that, I mean, we could talk for a long time, but I'll just give you some quick ones I can think of. For example, use of smart devices, IoT devices are collecting data and you need to store it and maintain it and analyze it. We're all producing data constantly. I mentioned that audio and video and images are all data, and that's constantly coming in through social media and all kinds of other channels. There's a greater need to combine those, that unstructured data that I just referenced, audio, images, video, along with structured data and semi-structured data in the same place, it makes sense of it all. The migration to the cloud is driving the need for more data infrastructure, the need for more real-time analysis, and then data protection regulations like GDPR and CCPA require more secure and compliant data infrastructures. So I think all of those things are driving the need and of course now AI. And then positioning yourself to take advantage of it. Well, I mentioned some of these things earlier, getting to know your data, your data sources, particularly proprietary data. That's really actually a hidden gem there because you could have some proprietary data that is unique to your firm that could really be useful to you. And then you have a firm that could really position you well for a competitive advantage in the future, if not today. So I would really put a lot of emphasis on taking a look at your proprietary data and think about your unique data capabilities that you might have, experiment with different ways to capture and analyze data, invest in a bit of research and some pilot projects or some proof of concepts. And then of course, you keep coming back to this, but upscaling your team or training them, or hiring outside support to help you. Everything we're talking about today and building a robust data infrastructure that allows for that future flexibility and improvements, a task like that can seem incredibly overwhelming and daunting for people maybe early on in that journey. So I'm curious for anyone listening that is obviously inspired by everything that we're talking about, but equally, they're a little bit nervous. Is there any advice that you'd have for an organization that's grappling with this challenge? Well, I think we always tailor our recommendations to the unique needs of the organization, what the client's current goals and future goals are and where they sit on the data maturity spectrum that I mentioned earlier. So on the far left of the spectrum, you have like data cleaning and reporting needs. So they might have some opportunities to do predictive modeling or decision making automation. And then on the far right, you have more like AI or bespoke machine learning needs. That's getting more complex, but it depends on where they are on the spectrum. So for more cost efficiencies, smaller data sets, I might recommend a platform like Snowflake. And for like larger data processing and wide range of machine learning tools and libraries, I might recommend a tool platform like Databricks. For data transformation needs, I might recommend DBT. It all depends on where the need is and the existing skills and the technology of the firm. So it's pretty hard to generalize. But if I were to make some big picture takeaways, I guess I could focus on making sure you align with your priorities. Be aware of the bright, shiny object, because that might take you off course. So really think about where do you want to go and stay focused on that objective. Think about the quality of your data, because what you put in is going to be what you get out. So if you don't have good quality inside your data systems, you're going to get out poor quality. So make sure you have quality data, make sure your data is accessible and that you know how it's going to go from its origin point to the destination. I think every business leader listening, they're all going to have a plan. They're going to have a vision of where they want to go, where they need to go. But they've also got that fine balancing act of business as usual, keeping the lights on. So I've got to ask, in your experience, what are some of the best practices for modernizing data infrastructure without disrupting its current operations? And I'm curious, are there any success stories or lessons learned that you can share just to inspire anybody listening? I hate to sound like an old lady or like I'm from the record. We adapt to the situation. But for us, our client's success is our own success. And we begin every engagement with taking a look at where does the client want to go? What are the unique challenges that they're facing? And what is my business model? What are the challenges? And what does modernization mean to them? But again, if I were to generalize, I would say maybe consider running in parallel, so maybe a new infrastructure with an existing infrastructure. I would also generalize by saying start small and iterate. And then also, and test and pivot. And I would also emphasize partnering with somebody that knows how to get you to that destination that you want to go to if you don't have that skill set in house. An example I can give you is one of our clients. I don't want to say the name, but they specialize in smart home and security solutions. And they operate across various domains, energy management and IoT devices. And they wanted to get more value and better understand how their product is being used by consumers. They needed to modernize their data analytics system to be more comprehensive and accurate and to provide them with insights on user behavior. They had an existing IoT MVP dashboard that needed to be improved and they wanted to develop a new one. So we proposed the development of a new IoT analytics dashboard while also improving their existing IoT MVP dashboard. These dashboards were aimed at providing insights into the user behavior, but also how the equipment was performing and the health of the IoT equipment. We conducted thorough testing to determine the feasibility of improving the cadence and quality in which the historical data was updated in the dashboard. So this testing enabled our client to choose whether or not to pursue any viable options. And with our guidance, our client was able to modernize to a unified data analysis framework that provided them with greater insights of the new IoT dashboard along with the existing IoT dashboard facilitated these insights. So we use tools like Tableau, Power BI, AirBite, Nucube, JS. The setup helped them improve customer segmentation and understand what product features were being underutilized. So they were able to keep both systems going and pretty much optimize their performance. The modern data analytics framework proposed by our team prioritized building on the existing IoT data and analysis approach. And it provided them with greater agility, accuracy, and scalability. This reduced the time to market and increased collaboration without any technical trade-offs. So that's one example. So you can keep things going, existing system, complements, the advances of new system. We have testing going on in the background. All these things go on together to help you keep without modernize, but without disrupting your current infrastructure. And you're scaling and being sustainable at the same time. Fantastic example there. I absolutely love it. And of course, we're now approaching that time of year where every futurist and thought leader is thinking about the headlines for 2024, what technologies are going to dominate the following year and what business trends are they going to predict? And of course, if we go back to November last year, I don't think anybody was writing about Gen. AI or chat GPT, but we all know what happened next. So I know how difficult this question is, is what I'm trying to say. But if I did ask you to look into the future, into a virtual crystal ball, how do you envision the evolution of data infrastructure over the next decade? And also, what role do you see Blue-Orange Digital playing in this landscape? Abhruis, what do you think? Well, I love this. I mean, this is my funnest thing is futurism, but it's hard. But we can base it on things that we know for sure. Well, not know for sure, but the pretty good chance of it happening. So data will continue to grow exponentially. Cloud computing is going to continue to grow. There's going to be exponential improvements in computer processing power. And then when you go back to the mountaineering analogy that I love, we're going to see an avalanche of data available. We have, we're going to need infrastructure in place to help make sense of that data. It's going to be critical. There's going to be more data and technology will be an instrumental part of many jobs, not just data scientists, but it's going to infiltrate a bunch of different jobs. And I think we're going to be more real time in the way that we work. We're going to be more tailored, more personalized. We're going to be able to, in many ways, have safer systems, but at the same time, be more, have more vulnerable systems as well. So the two are going to be hand in hand. Algorithms will be behind, increasingly behind everything that we do. And I think we're just going to increasingly be more digitized in the way that we take care of ourselves and our finances and the way that we communicate. And the way that we entertain ourselves. And then, I've been reading about the point where AI passes this Turing test and convinces us that it's human. We have quantum computing around the corner and it might soon be in the next 10 years, be available in the public for further accelerating data and research and security driven industries. We have 60 coming up with internet speeds available that are 100 times faster than 5G. Further increasing the need and the ability to make sense of data and use of data. And it's just the volume and needs of data will also mean increased energy needs, but there will also be advances in the way that we use energy to be smarter and cleaner. And then climate change, of course, is going to continue to be a global challenge. But I believe in us humans and I think we're going to pull through and I think we're going to use data and AI and advanced technologies to help us live more sustainably and heal our planet, or at least learn to live in a sustainable way. And Blue Orange, we're going to continue to learn and grow and make a significant impact on the way that data transformation is performed. And we're going to continue to help businesses leverage the evolving landscape and position our clients for success. We love to learn at Blue Orange. And so we're going to continuously learn and apply our learnings to the benefit of our clients. And I think that's an inspiring moment to end on. So much to think about. I mean, listen to you there. And there's so much to be excited for on the road ahead. I mean, I was also reading and also writing about the rumors around the superconductor at the moment and what that could mean for the energy industry. So much to think about. And we started the podcast today talking about your origin story and your career and how you or the path you took to Blue Orange Digital. But now we've come full circle. I'm going to have a bit of fun with you and ask you to leave everyone listening with one final gift. And that is, what was the soundtrack to that career, your story? Is there a song that means something to you that is important to you? All I'm going to ask is what would you like to add to a Spotify playlist? Is there a song that you'd like to add there? Yes. It's called Easy. Like no one ever said it was going to be easy. But the name of the song is called Easy and it's by singer-songwriter Bill Mudd. And it's off the album New Religion. And you can find it on Spotify. Fantastic. Well, I'm going to listen to that and get it straight added to the playlist after we finish recording today. So I cannot thank you enough for that. And finally, we've talked a lot about Blue Orange Digital. And obviously we've talked or we've provided a lot of generalized examples, but as you rightly pointed out a couple of times, every single client has got a unique set of requirements. So if anyone would like to just dive a little bit deeper and find out a little bit more information about how you might be able to help them, their industry, and maybe share a few examples, et cetera, where would you like to point everyone listening? Yeah. The best place to find me is on LinkedIn. And look for my name, Diana Bald, like B-A-L-D, like Eagle, Bald Eagle, Diana Bald, or Blue Orange. The color is Blue Orange. Blue Orange Digital is our firm. Re-chat anytime we're accessible and we love to chat. I'll add a link to that so people can find you and Blue Orange Digital nice and easily. You've been helping businesses with their digital transformation and building sustainable products across different industries for more than 20 years now. And your expertise guiding organizations in everything from budgeting for data infrastructure to modernizing it, pure golds in some of your answers and the examples you left today. But more than anything, just thank you for sharing your story with me and everyone listening to it. Thank you so much, Neil. I had fun and I appreciate the opportunity to share. So a huge thank you to Diana from sharing the intricate challenges of the recent past to the immense opportunities that are lying ahead. And for me, I think Diana's insights remind us of the significance of data in today's evolving business landscape. In everything from budgeting, planning, modernizing data infrastructure, it's not just about the technology though. It's about aligning goals, understanding market shifts and ensuring continuous growth and innovation. So as I wrap up today's episode, I'd love to take a moment to reflect on Diana's emphasis on treating data transformation as a journey. Akin to mountaineering, it requires preparation, adaptation and collaboration. So again, a huge thank you to Diana for sharing her invaluable knowledge and also to each and every one of you for tuning in and hopefully it sparked a few ideas in you. And as always, email me techblogwriteratlook.com, connect with me on LinkedIn at Neil C Hughes. Let me know your thoughts on anything we discussed today. But that's it for today, so until next time, don't be a stranger."}, "podcast_summary": "Diana Boldt, President and COO of Blue Orange Digital, was a guest on the Tech Talks Daily Podcast. She has over two decades of experience in guiding businesses through digital transformation and sustainable product building. Blue Orange Digital is a data consulting firm specializing in data science, machine learning, and AI. They help businesses gain insights, make better decisions, and improve their products and services with data. Diana discussed the challenges and opportunities of digital transformation, the immense potential of data infrastructure, and the importance of organizations rethinking their mindset towards it. She explained that data is exciting and has broad relevance in many industries. Diana emphasized the need for organizations to align their data infrastructure budget with their goals, consider cloud-based infrastructure for cost-effectiveness and scalability, prioritize data quality and security, and be aware of technical debt and vendor lock-in. She also shared a success story of helping a client modernize their IoT data analytics system without disrupting their current operations. Looking towards the future, Diana envisions exponential data growth, increased reliance on AI, improvements in computer processing power, and advancements in technologies like quantum computing and 6G. She sees Blue Orange Digital continuing to make a significant impact on data transformation and helping businesses leverage the evolving data landscape. Diana recommended the song \"Easy\" by Bill Mudd as the soundtrack to her career. She can be found on LinkedIn, and Blue Orange Digital's website provides more information on their services and expertise.", "podcast_guest": "Diana Boldt", "podcast_highlights": "- Highlight 1 of the podcast: \"We help businesses gain insights, make better decisions, and improve their products and services with data.\"\n\n- Highlight 2 of the podcast: \"Data will continue to grow exponentially. Cloud computing is going to continue to grow. There's going to be exponential improvements in computer processing power.\"\n\n- Highlight 3 of the podcast: \"We have to figure out data quality. We run across complex data sets and identifying patterns.\"\n\n- Highlight 4 of the podcast: \"For more cost efficiencies, smaller data sets, I might recommend a platform like Snowflake. And for larger data processing and wide range of machine learning tools and libraries, I might recommend a tool platform like Databricks.\"\n\n- Highlight 5 of the podcast: \"We're going to be more real-time in the way that we work. We're going to be more tailored, more personalized.\""}