{"podcast_details": {"podcast_title": "Inside the Strategy Room", "episode_title": "173. Taking an investor's perspective on your business", "episode_image": "https://www.omnycontent.com/d/playlist/708664bd-6843-4623-8066-aede00ce0c8a/a7ee33f2-d500-4226-b99c-af04013945d6/36587f70-89f9-4631-ac19-af04013945e0/image.jpg?t=1662145239&size=Large", "episode_transcript": " If you're helping an investor understand what drives your business, how your revenues, your earnings, your cash flows are going to move, there's always benefit to that. You're trying to help align what you believe the value of your business is and the outlook for your business with what investors are willing to underrate. From McKinsey's Strategy and Corporate Finance Practice, I'm Sean Brown and welcome to Inside the Strategy Room. You just heard from Justin Sanders, a partner in our New York office and one of our guests today. Justin co-leads our Shareholder Teardown Team, bringing a private equity investor perspective to corporate clients. And he also founded our work helping clients prepare for and respond to activist investors. Justin's joined by Chantal Beck, a partner in our London office, whose client work has focused on large-scale performance transformations in the energy sector. Chantal also leads our work on the energy transition globally. During our discussion today, we will cover why and how business leaders and CFOs in particular should try to see their businesses as their investors see them. We'll also build on the themes that Chantal and Justin recently presented on the topic of anticipating the investor perspective at our Global CFO Forum in London. We hope you enjoy the conversation. Well, thanks again for being here at the CFO Forum. I understand your session was really well received and looking forward to talking with you a little bit about it right now and also about the client reactions that you've gotten with the material. But just to kick us off, Justin, you can talk a little bit about this notion of what is an investor's perspective as it might differ from a CEO's perspective. Sure, absolutely. I think the core of an investor's perspective and how it differs from a CEO's perspective is at any point in time, an investor is thinking about, do I want to hold an investment in this business looking forward? History is something that will inform that investor's choice on whether to stay invested in the business or not. But they're going to be thinking about what's coming next, what's going forward, how do they think about forecasting the value they could get if they continue to invest in the business? In some ways, it's more dispassionate. It's more data-driven. It's less tied to necessarily choices, history, the social aspects that you might get in the executive room or the boardroom. And therefore, they're really thinking, do I want to keep my money in this business or do I want to put it somewhere else over time? And I think that just raises the bar in terms of data-driven and kind of in or out type decision-making in a dispassionate way that's sometimes harder to achieve when you're kind of operating a company day to day. Sure. It's a little more binary, if you will, right? Whether you're going to hold it or not or how long. Hold it or not, how long, and also what returns do you expect that you'll get from holding your investment in a business versus other alternatives that you might have, be it in that same sector or be it another sector? Got it. Chantelle, anything you want to add there? Yeah. I think what is important to understand is the CEO doesn't have much choice in the role. So they will optimize the company and thinking about also coming from the legacy, how to take it forward. But investor, as Justin just said, will always look from, okay, is the long-term value creation there? And is the company bold enough to make moves which are creating value in the long term? So what are the advantages of taking that investor mindset then? Is it that your stock price is going to go up? What are some of the things that you benefit from if you do this properly? One of the other reasons it's advantageous is in some ways investors are the customers of the CEO. They're choosing whether or not to be buyers of the company. And I'm not saying that that's a CEO's sole role. That's far from the case. One of many stakeholders. One of many stakeholders that they have to think about. And so it's the same way you would think about a product saying, really understand your customer. What are they looking for? What are they solving for? What are they choosing between? Taking that same perspective, thinking about your investor is a really valuable way to say what's the way in which they would evaluate this business? What's the way in which they would make that choice around whether to hold their investment, whether to release their investment? If you come at that with a customer's perspective, the investor's perspective, you're going to be in a much better position as an executive to solve for what those investors are looking for. And is there often a disconnect between the CEO's perspective on value creation and what an investor might be taking? I think they're often not exactly the same. Not necessarily divergent, but investors kind of have a focus, as Chintel had mentioned earlier on what is the long-term value creation potential of the business? Is management taking risks that are the bold moves that are going to be required to generate returns? Are they credibly delivering on those risks? Are they being transparent about what's working and what's not? And so do they line up one to one? Frequently not. Are they terribly divergent? I'd say less often, but that does come up some as well as we heard in the discussions today. And how much of this is a communications or investor relations issue versus truly making the bold move? Because I guess at a certain point, you want to find your intrinsic investors, the ones that believe in what you're going for in terms of a strategy. I think the investor perspective can function as holding up the mirror to the CEO. You have a long-term strategy, but sometimes you are in your own company, you hear a lot of your people's statements, holding up the mirror saying, hey, actually, you should be doing this, or why aren't you doing this? Or your costs have emerged higher than your peers. Have you looked at this recently helps to steer the direction? But also hearing it from the clients today that treating investors properly and really getting the best out of the relationship, holding each other in a discussion over time, explaining the strategy and how long-term value is created beyond the earnings call is something which creates a good discussion and value itself. I think I'd echo the same sentiment that's come from conversations today and conversations with my own clients recently, that the idea that the investors are going to look at facts and say, are we seeing the story we're hearing translating into results? There's show me stories and there's tell me stories. This is looking for the show me story. When those line up, there's transparent communication. You say, here's what's going on, here are the results, here's what we've demonstrated that shows that the strategy or the operations program, the productivity program, the overall transformation program that a company is working on is having the intended impact. That leads to a really great conversation. Where you see it sometimes go awry is the story that says, we're working on something, an investor can't see impact, and so we'll have more questions and really try to understand. There's a healthy tension there, but you want to make sure as a public corporation that you're communicating enough about where impact is coming from that investor can see it. What are some of the ways as a CFO, how do you bridge that? Maybe it's not a gap, but the two perspectives between the CEO's thoughts about how the company is creating value and what the outside market investors are looking at. I think nowadays there's so much data available outside in through web crawling, artificial intelligence and so on, so it has become much more sophisticated what you can get outside in. I think the CFO has a strategic role between the CEO who has the strategic direction, but also the investor department or so, which are sometimes a bit focused on the day-to-day hours from the sales side analysts in the calls. It's basically one of my clients we've been working with, the new incoming CFO, had to go through a lot of change management to resist the fact of answering all the nitty gritty questions in the earnings calls, but really making this value adding time for everyone, for the investors to join to explain how the long-term strategy is implemented. As you say, what are the proof points it's happening rather than just reacting on short-term moves in the industry? I think the CFO in particular plays an even more important role given this dynamic. There is so much information out there. As an example, if we want to look at a company as we think about what their agenda should look like, in the course of a couple of days we can ingest customer feedback from 80,000 websites, synthesize it and say, here's where you're strong and where you're weak. That didn't exist five years ago, this type of capabilities. I think what this does is it puts the CFO in a role where they can really play the translator role because at some point the information in the public sphere is triggering good conversations. At the end of the day, investors still think about a company as a financial investment and someone has to say, how do those pieces of data on what's going on in customer markets, what's going on in terms of the workforce, what of the relevant ESG themes matter for one company versus not? The CFO can translate all of that and say, well, how is that going to lead to different results and what does that mean in terms of priorities operationally and financially that the company could follow? Taking on that role as the translator between all the information that's out there and what the executive team really needs to focus on and think about doing and investing behind themselves, that's an even more critical role now than it was a few years ago just because there's so much more information to process. So if you're a CFO, in an ideal world, would you have somebody on your financial planning and analysis team who is charged with taking that outside in view or how do you actually execute that? I've seen it executed in a handful of ways, whether it's one individual, a small team, the use of advisors. What's important is saying you're going to have a perspective and does that mean you have to update it every month or every quarter? No. But at any point in time, you have a perspective on what information is out there that is shaping how an investor would think about the growth outlook for your business, growth headwinds for your business, margin opportunity or again, margin headwinds, capital intensity, especially as we see heavy industrial companies as an example faced with the growing trend of decarbonization. That's even more a question as well. And so making sure that somebody is kind of keeping that perspective and keeping their CFO well informed is really critical. And are there situations where you sort of set that first perspective and then you set trigger points for here are things that might happen exogenous to the company that I need to keep an eye on or even inside the company that may be things that would cause that outside investor to rethink what the investment thesis would be? Yeah. I mean, I think it's very different for every different industry, but we have looked at an industrial player who was very much dependent on oil price, but also on some regulatory decisions on decisions how carbon tax is going to be applied. And I think every company should look at a model. What would they depend on structurally and monitor these events and effects which affect the company? And I think that's actually what investors have been doing when they think about the outlook for a company for some time. And I love Chantal's example of oil and gas just because it's such a visible cycle that you can look at. And as I've done this analysis with companies that supply equipment into the oil and gas world, I'm picking this as just an example because it's so tangible. What you look at is if you pick any point in time, you can see big swings in what expectations are underwritten in a company's valuation. And so when you see companies that supply oil and gas equipment at the peak of oil prices, and you look at what's priced in, well, you see that expectations, the prices are going to come down. And therefore, equipment purchases are going to slow. And you're going to get operating deleverage as your factories aren't shipping as many units. That sounds very operational, but investors get that that's what's going to happen. And so they think about, well, where are we in the cycle? Do I have continued tailwinds? Do I have some upcoming headwinds? And they forecast that going forward. So what am I willing to underwrite as I make an investment in a business? And so knowing what those drivers of your business are, what those trigger points look like is a really valuable way to say, am I just trying to get my share price to go up? Or am I trying to understand that investors sees a different outlook than straight growth because they're understanding something about the markets that I'm exposed to? That's really powerful, right? Because it can help you unlock what should be your priorities and also what the general market expects your business to do as conditions change. Yeah. And maybe if I can add to that, I think it's also helping investors sometimes to clarify some of these trends. If I take an example from the chemical industry, petrochemicals, which is very close to oil and gas, investors understand the cyclicality. It's clear. It will go up and down depending on many factors, including oil price. But if you see volatility in specialty chemical companies, that's a whole different story. Investors don't understand that. So you also help your investors and your company to actually understand why there's suddenly cyclicality to explain those factors behind. So there's a little bit of an educational component to this as well in terms of? There should always be a little bit of an educational component. And I think there's a fine line between just storytelling and education. But if you're helping an investor understand what drives your business, how your revenues, your earnings, your cash flows are going to move, there's always benefit to that. You're trying to help align what you believe the value of your businesses and the outlook for your business with what investors are willing to underwrite. Awesome. So let's talk a little bit about this notion of taking specifically a private equity investor perspective. You see a lot of private equity companies purchase publicly held companies. And they have to have a very, very sharp perspective. What are some of the things that private equity investors might do in terms of developing that investor perspective? And is there anything that might then apply for CFO of a publicly held company that they should be trying to think about? Not so much to make themselves appealing for PE, but just to sort of understand that's another group of investors that may hold an interest in their business. Sure. I think there's sort of four steps that we talked about in the session that we ran this week. And I think it kind of starts with saying, one, you're going to connect the strategic outlook for your business to actions and the value of the business today. Second step would be to say, well, then kind of understand what the return expectations are for investor. Three would then be to look at benchmarks and say, where operationally could you do more? Could you capture headroom that the business has? And then four, turn that into real tangible actions that are going to drive cash flows. And the reason I go back to that framing is if you think about a private equity investor with a time horizon, they're trying to really increase the value of a company by taking a specific set of operating actions. Depending on the nature of the investor, the specific investment they're making, that might be around driving growth and capturing the operating leverage that comes from that growth as a way to grow the earnings and the cash flows of the business. It may have to do with finding efficiencies in core operations or in the organizational structure of a company. It may have to do with kind of sweating your assets, using capital more effectively, and finding ways to increase throughput out of existing footprint, be more efficient with what you have versus having to spend more. These are all tools that are going to help increase the cash flow of the company. And I think the difference between what you see in probably the typical public markets is an investor whose decision is, do I want to hold, do I want to buy more, do I want to sell some of my exposure in a company, by nature, that's slightly more passive, well-informed, but passive in the event of a controlling interest like a private equity investor. They're saying we want to actually see a company take some actions to capture headroom that's kind of untapped right now. And therefore, the focus on those actions, the amount of granularity that's going behind that investment thesis, it's quite high. And therefore, the typical private equity investor is going in with not just an investment thesis, but a plan on how to execute that investment thesis so they can capture value. And they incentivize the management team heavily on that, right? And it's really a focus also on the talent to make that happen, which I think could also create more trust for intrinsic investors and companies if they would do that more thoroughly as well. Sure. And Sean, maybe I'd come back because I think you had two parts to your question. One is kind of what is that perspective of a private equity investor? And the second was, if you're a CFO, what can you learn from this? And if you think about what we're describing, there's nothing in those kind of four steps, right, that the CFO of a company can't do on their own. And that's what we encourage. And it was a lot of the conversation over the last couple of days here, just encouraging our clients to take that hard look at their own business and say, if it was my money, if I was investing and taking this company private, what would I do to generate 20% rates of return and higher? Which is high when you think about a typical public equity return, but not so high when you think about what private equity investors strive for. And so just bringing a little bit of that perspective and saying, how can I get really sharp on what's going to deliver the most value from my business is a really useful exercise to help focus and prioritize and drive the right cadence on operational improvements that will matter. And I think what some CFOs are still struggling with to at least get into the organization is strategic capital allocation. Very often, historically, you have invested in all businesses the same because they are also powerful leaders. And private equity companies are much better or tend to focus capital where they really see growth and also take it away from businesses where they don't see it or parts of the businesses. And I think that is something we've been discussing a lot in the last few days. Awesome, any case examples that you can share of the power of taking this approach in terms of what this can do to focus a CFO, CEO, and executive team on those levers that create the most value? Because I think any CEO and CFO would say, we're trying to create as much value for stakeholders as possible. But is there a way to make this a little bit more tangible in terms of your experience working with clients? You mentioned a 20% return as an example, Justin. Yeah, so I've seen it in a few contexts, and every one is different. So I'm always a little bit reluctant to extrapolate a rule from a single example. But I'm now thinking about this across maybe a dozen different situations. There's a thread that I think is consistent. In almost every situation, we, like our clients and like most investors, start with a thesis. I might even say a hypothesis, not yet a form of thesis, but a hypothesis on where the 20% level of return is going to come from. And what I would say is that the importance of being holistic in testing that thesis is critical. And the pattern that I see that's consistent is even in situations where our mathematics, our arithmetic would tell us growth is going to be the answer. It's usually not just growth. We see there's a growth opportunity, but the operating leverage you can capture from that growth that leads to margin expansion ends up being even more valuable, which you may not intuitively look at going in. I'll take whatever growth I can get, might be the mindset, but by being holistic and saying, well, let's really think about where is it going to come from? How are we going to generate growth? And is it just growth or is it growth that is getting me more output from my facilities, allowing me to get more leverage on all the fixed costs I have as a company that allows you to accelerate your earnings growth up into those double digits level of numbers? And then I see the inverse as well. It's pretty easy to look at benchmarks on costs and just say, if a company is in the bottom quartile of margins in its industry, that there's a margin improvement opportunity. That naturally leads you towards where can I take out costs, which is almost always a driver in those situations. But looking at that in absence of saying, well, where can I also get leverage? Operating leverage, that is, from the business. And where is growth in what parts of the business is growth going to contribute? That's what's really important. I think it ties back nicely to what Chantal was saying around strategic capital allocation. Because what we're talking about is taking a holistic view of a business and understanding where you want to drive different type of operational improvements. That's probably the most common thread between situations where we've kind of seen really big value unlocks in businesses. Maybe to add one more flag, we have also worked with companies who are actually really good right now. So it's always- Already performing very well. Exactly. They are the number one player in their industry segment. And you would tend to say, well, we are actually doing well. But then if you look at the investor perspective and figure out, okay, the growth and the profitable growth, which is baked in in the current share price, it's actually very challenging to achieve going forward. Because if a company is already large, number one player, where is all that profitable growth going to come from? So there is often a challenge to say just because you're good right now, it doesn't mean you are good in the future. So what are the numbers really implied in your share price? And where is that absolute EBITDA going to come from? It's also a good question we've been asked recently. And I think that when we deal with the leading player and have these conversations, what we observe, and I would give credit to those leading players the way they think, is they're hunting for headroom. Where is that next opportunity coming from? And keeping a really active view on where is there more headroom to go after, not just how do we run the same playbook we've always run. That really is a big differentiator between those that can maintain outperformance of a long period of time and those who are high performers for a period and stagnate. What are some of the barriers to taking this approach? And how do you overcome them? I think maybe the biggest barrier is the classic one, the hardest part is getting started. And I say that because of two hard to balance factors. As we mentioned earlier, the amount of data to process and the number of questions to answer can be overwhelming for even a talented executive. And taking an investor's mindset, really taking an investor's mindset where you are sleuthing at what matters and what doesn't. And testing and building and refining your investment thesis so that you have a clear perspective on the answer. Those are two, separately, those are both challenges. Put them together and it's hard to get started or nowhere to get started. The important thing is to start. And anyone can get better as they do this over time, as I think we have as a firm, as we've learned to ingest more data, recognize patterns, understand implications. It takes time to hone those skills. And so getting started versus waiting for perfection is, I think, the barrier that the most successful businesses overcome. And a very practical tip is we've seen successful CFOs doing that on the offside. Just to take time out of this daily interactions and daily challenges to really do it, shut down your laptops for a few minutes or half a day and really think about it. And then as Justin said, you got started and then it will work out. Awesome. This has been really, really fun and enlightening and appreciate you both taking the time. Thanks again and looking forward to continuing the conversation. Likewise, thanks for having us. Thank you. And thank you to all of our listeners for joining us today. As always, if you'd like to share feedback or an idea for a future podcast, just email us at itsr at McKinsey dot com. That stands for Inside the Strategy Room. You can also share your ratings and reviews on your favorite podcast player with many thanks to everyone who's already done so. We really enjoy all your comments and feedback and please do keep them coming. Again, if you enjoyed this episode and you'd like to subscribe, you can also follow our weekly series on your favorite podcast player and you can access our entire library of previous episodes there. We also offer an Inside the Strategy Room podcast collection page available at mckinsey.com slash I T S R where you can easily search our prior podcasts across six major themes and also access written transcripts of all of those conversations. Finally, if you'd like to receive alerts on our latest publications and insights, we encourage you to sign up on our practice insights page at mckinsey dot com slash S C F for strategy and corporate finance or follow us on Twitter or X at M C K strategy or connect with us on LinkedIn at the McKinsey strategy and corporate finance practice page. Thanks again for listening. We look forward to having you join us again next week inside the strategy room."}, "podcast_summary": "Summary:\n- The podcast is called Inside the Strategy Room and is hosted by Sean Brown\n- The podcast discusses the perspective of investors and how it differs from that of CEOs\n- Investors are focused on future value and making data-driven decisions, while CEOs may be more tied to history and social factors\n- The podcast covers why business leaders and CFOs should see their businesses as investors do\n- It explores how to anticipate the investor perspective and align the value of the business with what investors are looking for\n- The episode features guests Justin Sanders and Chantal Beck, who bring their experience in private equity and performance transformations in the energy sector\n- They discuss the advantages of taking an investor mindset and how it can lead to increased stock price and better relationships with investors\n- The podcast explores the disconnect that may exist between the CEO's perspective on value creation and the investor's perspective\n- The CFO plays a crucial role in bridging that gap and translating the investor perspective into actionable strategies\n- Private equity investors have a sharp perspective and focus on specific operating actions to increase the value of a company\n- The CFO of a publicly held company can learn from this approach by taking a holistic view of the business and identifying areas for growth and operational improvements\n- Examples are shared of how taking this approach can create tangible value for a company\n- The barriers to taking this approach include the overwhelming amount of data and questions to answer, but it's important to get started and refine the skills over time\n- Practical tips include taking time out to think and shut down laptops, and the importance of staying proactive and not waiting for perfection", "podcast_guest": "Sean Brown", "podcast_highlights": "- Highlight 1: \"If you're helping an investor understand what drives your business, how your revenues, your earnings, your cash flows are going to move, there's always benefit to that.\"\n- Highlight 2: \"The core of an investor's perspective and how it differs from a CEO's perspective is at any point in time, an investor is thinking about, do I want to hold an investment in this business looking forward?\"\n- Highlight 3: \"What is important to understand is the CEO doesn't have much choice in the role. So they will optimize the company and thinking about also coming from the legacy, how to take it forward. But investor, as Justin just said, will always look from, okay, is the long-term value creation there?\"\n- Highlight 4: \"One of the other reasons it's advantageous is in some ways investors are the customers of the CEO. They're choosing whether or not to be buyers of the company.\"\n- Highlight 5: \"The CFO can translate all of that and say, well, how is that going to lead to different results and what does that mean in terms of priorities operationally and financially that the company could follow?\""}